import random

# Ξεκινάει το πρόγραμμα

# Φτιάχνω μια λίστα με 3 στοιχεία που αποτελούν τα φανάρια
# --> κάθε στοιχείο της λίστας θα έχει 3 τιμές "name" : "fanari 1", "cars": 10, "isGreen": True

# Βάζω σε κάθε φανάρι τυχαίο αριθμό αυτοκινήτων (από 1 έως 100)

# Επανέλαβε για όσο κανένα φανάρι δεν έχει μηδέν αυτοκίνητα:
#     Βρές ποιο είναι το φανάρι με τα περισσότερα αυτοκίνητα  
#          --> Κάντο πράσινο
#          --> Να φύγουν τυχαία από 5-10 αυτοκίνητα
#          --> Να διαιρεθούν ακέραια / 2 τα αυτοκίνητα που φύγανε και να πάνε στα άλλα 2 φαναρια
#          --> Τύπωσε για όλα τα φανάρια το όνομα τους, την κατάσταση τους και τα αυτοκίνητα που τώρα έχουν
#          

x=random.randrange(1, 10)

print(x)
